<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Synergy Video Express Downloader</string>
    <key>Identifier</key>
    <string>UNT-AITS-FASA.download.Synergy Video Express</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Synergy Video Express</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://www.synergysportstech.com/apps/videoexpress/Production/MacOS/appcast.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
